# Pandas Intro (continued)

By the end of this lecture, students should feel comfortable with:
* Manipulating data in pandas by sorting, grouping, and aggregating
* Merging multiple Dataframes together
* Joining a Dataframe with itself

### Part 1: Aggregation, Group By and Sort Review

Below is a dataframe, with values initialized as a list-of-lists and columns initialized as a list.

In [1]:
import pandas as pd

df = pd.DataFrame(
    [[123, 'xt23', 20], [123, 'q45', 2], [123, 'a89', 25], [77, 'q45', 3],
     [77, 'a89', 30], [92, 'xt23', 24], [92, 'm33', 60], [92, 'a89', 28]],
    columns=['userid', 'product', 'price'])
df

   userid product  price
0     123    xt23     20
1     123     q45      2
2     123     a89     25
3      77     q45      3
4      77     a89     30
5      92    xt23     24
6      92     m33     60
7      92     a89     28

**Q: What is the maximum price anyone has paid?**

In [2]:
df['price'].max()

60

In [3]:
df[df['price'] == df['price'].max()]

   userid product  price
6      92     m33     60

**Q: We want the maximum price per user. Hint: Use groupby.**

In [4]:
df.groupby('userid')[['price']].max()

        price
userid
77         30
92         60
123        25

**Q: What is the total amount paid by user?**

Note: Pandas will smartly leave out columns for which that aggregation doesn't have meaning.

In [5]:
df.groupby('userid').sum()

        price
userid
77         33
92        112
123        47

**Q: Sort the dataframe by userid first, and then price, both ascending.**

In [6]:
df.sort_values(['userid', 'price'], ascending=[True, True])

   userid product  price
3      77     q45      3
4      77     a89     30
5      92    xt23     24
7      92     a89     28
6      92     m33     60
1     123     q45      2
0     123    xt23     20
2     123     a89     25

### Part 2: Combining Techniques

**Q: We want the maximum price each user paid, and the product associated with that price.**

Note the comparison with SQL: In SQL, you groupby and then sort, but in pandas, it's easier to do it the other way around.

In [8]:
df.sort_values(['userid', 'price'], ascending=[True, False])

   userid product  price
4      77     a89     30
3      77     q45      3
6      92     m33     60
7      92     a89     28
5      92    xt23     24
2     123     a89     25
0     123    xt23     20
1     123     q45      2

In [11]:
(df.sort_values(['userid', 'price'], ascending=[True, False]).groupby('userid')
 .head(1))

   userid product  price
4      77     a89     30
6      92     m33     60
2     123     a89     25

### Part 3: Exploring The Index

Let's add a new column.

In [12]:
df['website'] = [
    'Amazon', 'Amazon', 'NewEgg', 'NewEgg', 'NewEgg', 'Amazon', 'Amazon',
    'Amazon'
]
df

   userid product  price website
0     123    xt23     20  Amazon
1     123     q45      2  Amazon
2     123     a89     25  NewEgg
3      77     q45      3  NewEgg
4      77     a89     30  NewEgg
5      92    xt23     24  Amazon
6      92     m33     60  Amazon
7      92     a89     28  Amazon

**Q: What is the total amount paid by each user on each website?**

In [13]:
df.groupby(['userid', 'website']).sum()

                price
userid website
77     NewEgg      33
92     Amazon     112
123    Amazon      22
       NewEgg      25

Now let's do the same groupby as above, but set the as_index flag to "False". This will result in a flat table instead of the nested indexes.

In [14]:
df.groupby(['userid', 'website'], as_index=False).sum()

   userid website  price
0      77  NewEgg     33
1      92  Amazon    112
2     123  Amazon     22
3     123  NewEgg     25

### Part 4: Merging

Let's now create a second table:

In [15]:
df2 = pd.DataFrame(
    [[123, 'USA'], [77, 'Canada'], [92, 'USA']], columns=['userid', 'country'])
df2

   userid country
0     123     USA
1      77  Canada
2      92     USA

We can combine the two tables using a merge function. What it does is, it will do a pairwise comparision of every row in table1 with every row in table2 and if the "on" condition matches, it will create a single row with columns from both those matched rows.

Merge of two tables with 5 rows each can give as little as 0 rows and as much as 25 rows.

    [1,2,3,4,5] merged with [6,7,8,9,10] will give 0 rows
    [1,2,3,4,5] merged with [1,2,3,4,5] will give 5 rows
    [1,1,1,1,1] merged with [1,1,1,1,1] will give 25 rows

In [16]:
pd.merge(df, df2, on='userid')

   userid product  price website country
0     123    xt23     20  Amazon     USA
1     123     q45      2  Amazon     USA
2     123     a89     25  NewEgg     USA
3      77     q45      3  NewEgg  Canada
4      77     a89     30  NewEgg  Canada
5      92    xt23     24  Amazon     USA
6      92     m33     60  Amazon     USA
7      92     a89     28  Amazon     USA

**Q: What is the total amount paid per country?**

In [17]:
pd.merge(df, df2, on='userid').groupby(['country'])[['price']].sum()

         price
country
Canada      33
USA        159

**Q: What is the average amount paid per country and website?**

In [18]:
(pd.merge(df, df2, on='userid').groupby(['country', 'website'], as_index = False)[['price']]
 .mean() )

  country website  price
0  Canada  NewEgg   16.5
1     USA  Amazon   26.8
2     USA  NewEgg   25.0

### Part 5: The Final Question - A Demo

Let's add another column: purchase date

In [19]:
df['date'] = [
    '2018-01-12', '2018-01-08', '2018-01-06', '2018-01-03', '2018-01-05',
    '2018-01-04', '2018-01-07', '2018-01-02'
]
df

   userid product  price website        date
0     123    xt23     20  Amazon  2018-01-12
1     123     q45      2  Amazon  2018-01-08
2     123     a89     25  NewEgg  2018-01-06
3      77     q45      3  NewEgg  2018-01-03
4      77     a89     30  NewEgg  2018-01-05
5      92    xt23     24  Amazon  2018-01-04
6      92     m33     60  Amazon  2018-01-07
7      92     a89     28  Amazon  2018-01-02

**Q: Here is a tricky task. For each row, I want the average purchase price for that user prior to that purchase.**

One option is to do some loops. But another solution is to perform a "self-join" in which a table/dataframe is merged with itself, then filter the result to exclude records with information from the future.

### Movie / Drink Example

But first, quick question:

Say you merge (or 'join' if you come from SQL) two dataframes with 3 rows each, how many rows would you end up with?

Could be anything between 0-9.

Consider the following examples, where table x has users and the movies they like. And table y has users and the drink they like. And let's do a merge to come up with possible movie and drink pairings for any user. In case A, we get 0 rows, in case B, we get 3 rows and case C we get 9 rows.

#### Merge Two Tables with No IDs in Common

In [21]:
dfx = pd.DataFrame(
    [[1, 'Godfather'], [2, 'Amelie'], [3, 'Chicago']],
    columns=['userid', 'movies'])
dfx

   userid     movies
0       1  Godfather
1       2     Amelie
2       3    Chicago

In [28]:
dfy = pd.DataFrame(
    [[4, 'Ice Tea'], [5, 'Pepsi'], [6, 'Sprite']], columns=['userid', 'drink'])
dfy

   userid    drink
0       4  Ice Tea
1       5    Pepsi
2       6   Sprite

In [23]:
dfm = pd.merge(dfx, dfy, on='userid')
dfm

Empty DataFrame
Columns: [userid, movies, wines]
Index: []

#### Merge Two Tables with IDs in Common (1 Value Per ID)

In [30]:
dfx = pd.DataFrame(
    [[1, 'Godfather'], [2, 'Amelie'], [3, 'Chicago']],
    columns=['userid', 'movies'])
dfx

   userid     movies
0       1  Godfather
1       2     Amelie
2       3    Chicago

In [31]:
dfy = pd.DataFrame(
    [[1, 'Ice Tea'], [2, 'Pepsi'], [3, 'Sprite']], columns=['userid', 'drink'])
dfy

   userid    drink
0       1  Ice Tea
1       2    Pepsi
2       3   Sprite

In [32]:
dfm = pd.merge(dfx, dfy, on='userid')
dfm

   userid     movies    drink
0       1  Godfather  Ice Tea
1       2     Amelie    Pepsi
2       3    Chicago   Sprite

#### Merge Two Tables with IDs in Common (Multiple Values Per ID)

In [33]:
dfx = pd.DataFrame(
    [[1, 'Godfather'], [1, 'Amelie'], [1, 'Chicago']],
    columns=['userid', 'movies'])
dfx

   userid     movies
0       1  Godfather
1       1     Amelie
2       1    Chicago

In [34]:
dfy = pd.DataFrame(
    [[1, 'Ice Tea'], [1, 'Pepsi'], [1, 'Sprite']], columns=['userid', 'drink'])
dfy

   userid    drink
0       1  Ice Tea
1       1    Pepsi
2       1   Sprite

In [35]:
dfm = pd.merge(dfx, dfy, on='userid')
dfm

   userid     movies    drink
0       1  Godfather  Ice Tea
1       1  Godfather    Pepsi
2       1  Godfather   Sprite
3       1     Amelie  Ice Tea
4       1     Amelie    Pepsi
5       1     Amelie   Sprite
6       1    Chicago  Ice Tea
7       1    Chicago    Pepsi
8       1    Chicago   Sprite

### Back to the Question

Now let's return to the original question: For each row, I want the average purchase price for that user prior to that purchase. Let's do a merge on itself and filter.

Here are the steps we're going to take:
1. **MERGE**: Join table on itself. For each userid / date combo, show me all userid / date / price combos.
1. **FILTER**: For each userid / date combo, keep only the userid / date / price combos that were from earlier. Filter everything else out.
1. **AGGREGATE**: For each userid / date combo, find the average price for the remaining rows.
1. **MERGE**: Combine these values with the original dataframe for the final result.
1. **SORT**: Sort to make the results look pretty.

#### MERGE: Join table on itself. For each userid / date combo, show me all userid / date / price combos.

In [40]:
df_date = df[['userid', 'date']]
df_date

   userid        date
0     123  2018-01-12
1     123  2018-01-08
2     123  2018-01-06
3      77  2018-01-03
4      77  2018-01-05
5      92  2018-01-04
6      92  2018-01-07
7      92  2018-01-02

In [41]:
df_all = df[['userid', 'price', 'date']]
df_all

   userid  price        date
0     123     20  2018-01-12
1     123      2  2018-01-08
2     123     25  2018-01-06
3      77      3  2018-01-03
4      77     30  2018-01-05
5      92     24  2018-01-04
6      92     60  2018-01-07
7      92     28  2018-01-02

In [42]:
df2 = pd.merge(df_date, df_all, on='userid')
df2

    userid      date_x  price      date_y
0      123  2018-01-12     20  2018-01-12
1      123  2018-01-12      2  2018-01-08
2      123  2018-01-12     25  2018-01-06
3      123  2018-01-08     20  2018-01-12
4      123  2018-01-08      2  2018-01-08
5      123  2018-01-08     25  2018-01-06
6      123  2018-01-06     20  2018-01-12
7      123  2018-01-06      2  2018-01-08
8      123  2018-01-06     25  2018-01-06
9       77  2018-01-03      3  2018-01-03
10      77  2018-01-03     30  2018-01-05
11      77  2018-01-05      3  2018-01-03
12      77  2018-01-05     30  2018-01-05
13      92  2018-01-04     24  2018-01-04
14      92  2018-01-04     60  2018-01-07
15      92  2018-01-04     28  2018-01-02
16      92  2018-01-07     24  2018-01-04
17      92  2018-01-07     60  2018-01-07
18      92  2018-01-07     28  2018-01-02
19      92  2018-01-02     24  2018-01-04
20      92  2018-01-02     60  2018-01-07
21      92  2018-01-02     28  2018-01-02

#### FILTER: For each userid / date combo, keep only the userid / date / price combos that were from earlier. Filter everything else out.

In [43]:
df3 = df2[df2['date_x'] > df2['date_y']]
df3

    userid      date_x  price      date_y
1      123  2018-01-12      2  2018-01-08
2      123  2018-01-12     25  2018-01-06
5      123  2018-01-08     25  2018-01-06
11      77  2018-01-05      3  2018-01-03
15      92  2018-01-04     28  2018-01-02
16      92  2018-01-07     24  2018-01-04
18      92  2018-01-07     28  2018-01-02

#### **AGGREGATE**: For each userid / date combo, find the average price for the remaining rows.

In [44]:
df4 = df3.groupby(['userid', 'date_x'], as_index=False)[['price']].mean()
df4.rename(columns={'price': 'avg_prior_price'}, inplace=True)
df4

   userid      date_x  avg_prior_price
0      77  2018-01-05              3.0
1      92  2018-01-04             28.0
2      92  2018-01-07             26.0
3     123  2018-01-08             25.0
4     123  2018-01-12             13.5

#### **MERGE**: Combine these values with the original dataframe for the final result.

In [45]:
df

   userid product  price website        date
0     123    xt23     20  Amazon  2018-01-12
1     123     q45      2  Amazon  2018-01-08
2     123     a89     25  NewEgg  2018-01-06
3      77     q45      3  NewEgg  2018-01-03
4      77     a89     30  NewEgg  2018-01-05
5      92    xt23     24  Amazon  2018-01-04
6      92     m33     60  Amazon  2018-01-07
7      92     a89     28  Amazon  2018-01-02

In [46]:
df4.index

RangeIndex(start=0, stop=5, step=1)

In [49]:
final = df.merge(
    df4,
    left_on=['userid', 'date'],
    right_on=['userid', 'date_x'],
    )
final

   userid product  price website        date      date_x  avg_prior_price
0     123    xt23     20  Amazon  2018-01-12  2018-01-12             13.5
1     123     q45      2  Amazon  2018-01-08  2018-01-08             25.0
2      77     a89     30  NewEgg  2018-01-05  2018-01-05              3.0
3      92    xt23     24  Amazon  2018-01-04  2018-01-04             28.0
4      92     m33     60  Amazon  2018-01-07  2018-01-07             26.0

#### **SORT**: Sort to make the results look pretty.

In [50]:
final.sort_values(by=['userid', 'date'])

   userid product  price website        date      date_x  avg_prior_price
2      77     a89     30  NewEgg  2018-01-05  2018-01-05              3.0
3      92    xt23     24  Amazon  2018-01-04  2018-01-04             28.0
4      92     m33     60  Amazon  2018-01-07  2018-01-07             26.0
1     123     q45      2  Amazon  2018-01-08  2018-01-08             25.0
0     123    xt23     20  Amazon  2018-01-12  2018-01-12             13.5